# IFCCategory Template Set Active Template(Document) Method

Source: https://www.revitapidocs.com/2026/9c435b89-7518-5c40-41f1-98fdf2998a14.htm

---

| IFCCategory Template Set Active Template(Document) Method |
| --- |

**Note: This API is now obsolete.**

Sets the mapping template element to be the active mapping template in the document.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit.")]
public void SetActiveTemplate(
	Document document
)
```

```
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit.")>
Public Sub SetActiveTemplate (
	document As Document
)
```

```
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit.")]
void SetActiveTemplate(
	Document^ document
)
```

```
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit.")>]
member SetActiveTemplate :
        document : Document -> unit
```

#### Parameters

document Document
:   The document to set.

Exceptions

| Exception | Condition |
| --- | --- |
| ModificationForbiddenException | The document is in failure mode: an operation has failed,  and Revit requires the user to either cancel the operation  or fix the problem (usually by deleting certain elements).  \-or\-  The document is being loaded, or is in the midst of another  sensitive process. |
| ModificationOutsideTransactionException | The document has no open transaction. |

See Also

#### Reference

IFCCategoryTemplate Class SetActiveTemplate Overload Autodesk.Revit.DB Namespace